nfi/cooja-ng/src/motes/msp430_elf_mote.c
/*
 * msp430_elf_mote — boot policy, Cooja-style execute tick, and radio
 * endpoint ops for the MSP430 emulated-ELF mote kind (Phase 4, M21 —
 * docs/design/refactor-plan.md §3.17).
 *
 * Bodies are character-identical moves of the former runner code
 * (test/test_mixed_multinode.c init_msp430_node / tick_one_msp430 /
 * msp_radio_ops), with the enumerated seam substitutions: runner
 * callbacks → env members, nodes[idx] → the node pointer.
 *
 * The msp_mote_ops adapter table (execute/serial_input/...) stays in
 * the runner: it is entangled with emu_rx_queue_drain (frame-delivery
 * policy → Phase 5), ticking_node_idx (shared with runner RF
 * handlers → Phase 5), and the baud-paced serial injection's
 * scheduling.  Per §3.17 those follow their dependencies.
 */
#include "mote_impl.h"

#include "msp430_elf.h"
#include "msp430_usart.h"   /* msp_mote_serial_input (M38) */
#include "sim_state.h"      /* SIM_RADIO_* for msp_mote_ui_radio_state (M38) */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* ============================================================
 * MSP430 PC-trace debug instrumentation (Phase 10 M55)
 *
 * Firmware-level cc2420_transmit / TSCH EB-process / queue-add counters,
 * driven by the CPU's pc_trace hook.  Lives in the MSP430 module (not the
 * runner) so the runner needs no MSP430 chip access for it.
 * ============================================================ */

static uint32_t srh_trace_fn_addr;
static int cc2420_transmit_count;
static int tsch_eb_process_count;
static int tsch_queue_add_count;

static void srh_trace_cb(void *data, uint32_t pc, uint32_t *reg, uint8_t *mem) {
    (void)data; (void)reg; (void)mem;
    /* Track firmware-level cc2420_transmit calls */
    if (srh_trace_fn_addr && pc == srh_trace_fn_addr)
        cc2420_transmit_count++;
    /* Track EB process calls */
    if (pc == 0xcb32)
        tsch_eb_process_count++;
    /* Track queue add */
    if (pc == 0xb138)
        tsch_queue_add_count++;
}

/* Install the PC-trace instrumentation on an MSP430 node.  No-op + returns 0
 * for non-MSP430 nodes or when cc2420_transmit can't be resolved; otherwise
 * returns the resolved cc2420_transmit address so the caller can emit its
 * historical "PC trace: ..." line. */
uint32_t msp430_elf_mote_install_pc_trace(mixed_node_t *node) {
    if (node->type != NODE_MSP430)
        return 0;
    uint32_t tx_addr =
        msp430_elf_find_symbol(node->firmware_path, "cc2420_transmit");
    if (!tx_addr)
        return 0;
    srh_trace_fn_addr = tx_addr;
    cc2420_transmit_count = 0;
    tsch_eb_process_count = 0;
    tsch_queue_add_count = 0;
    /* Set range to cover all code including memcpy in .rodata area */
    node->plat.msp.cpu.pc_trace_lo = 0x3d00;
    node->plat.msp.cpu.pc_trace_hi = 0x10000;
    node->plat.msp.cpu.pc_trace_fn = srh_trace_cb;
    node->plat.msp.cpu.pc_trace_data = node;
    return tx_addr;
}

/* Report the PC-trace counters (read by the end-of-run stats, M58). */
void msp430_elf_mote_pc_trace_counts(int *cc2420_tx, int *eb_process,
                                     int *queue_add) {
    if (cc2420_tx)  *cc2420_tx  = cc2420_transmit_count;
    if (eb_process) *eb_process = tsch_eb_process_count;
    if (queue_add)  *queue_add  = tsch_queue_add_count;
}

/* Verbose [UIP] dump (Phase 10 M57): inspect a sending MSP430 node's
 * uip_aligned_buf (IPv6 header + SRH) from chip memory.  Type-blind entry —
 * no-op unless this is MSP430 node 1 (the historical debug filter).  Moved
 * out of the runner's frame-observed hook so the runner needs no MSP430 chip
 * access. */
void msp430_elf_mote_dump_uip(const mixed_node_t *node) {
    if (node->type != NODE_MSP430 || node->id != 1)
        return;
    uint32_t uip_buf_sym =
        msp430_elf_find_symbol(node->firmware_path, "uip_aligned_buf");
    if (uip_buf_sym && uip_buf_sym + 40 < node->plat.msp.cpu.max_mem) {
        const uint8_t *ip6 = node->plat.msp.cpu.memory + uip_buf_sym;
        uint16_t ulen = (ip6[4] << 8) | ip6[5];
        const uint8_t *cpumem = node->plat.msp.cpu.memory;
        uint8_t pfx_len = cpumem[0x2964];
        uint8_t inst_used = cpumem[0x2930];
        fprintf(stderr, "  [UIP] dest=%02x%02x:...:%02x%02x nh=%d plen=%d pfxlen=%d inst=%d SRH@40=",
            ip6[24],ip6[25],ip6[38],ip6[39], ip6[6], ulen,
            pfx_len, inst_used);
        for (int h = 40; h < 64; h++)
            fprintf(stderr, "%02x", ip6[h]);
        fprintf(stderr, "\n");
    }
}

/* ============================================================
 * End-of-run diagnostics (Phase 10 M58)
 *
 * The per-node MSP430 terminal-report blocks (SFD/Timer-B, TSCH state,
 * CC2420 stats, neighbor + SR tables) — chip-memory + firmware-symbol reads
 * — moved out of the runner behind the dump_diagnostics op.  The runner
 * drives the section order; cross-cutting aggregates stay runner-side.
 * ============================================================ */

void msp430_elf_mote_dump_diagnostics(const sim_mote_t *m, int section) {
    mixed_node_t *node = MOTE_IMPL(m);
    const char *firmware_path = node->firmware_path;
    switch (section) {
    case SIM_MOTE_DIAG_SFD_TIMERB: {
        uint8_t *mem = node->plat.msp.cpu.memory;
        uint16_t sfd_time = mem[0x24f8] | (mem[0x24f9] << 8);
        msp430_timer_t *tb = &node->plat.msp.timer_b;
        printf("  Node %d: sfd_start_time=%u TB_mode=%d TB_CCR1=%u TB_CCTL1=0x%04x\n",
               node->id, sfd_time, tb->mode, tb->ccr[1], tb->cctl[1]);
        break;
    }
    case SIM_MOTE_DIAG_TSCH_STATE: {
        uint32_t tsch_coord = msp430_elf_find_symbol(firmware_path, "tsch_is_coordinator");
        uint32_t tsch_init = msp430_elf_find_symbol(firmware_path, "tsch_is_initialized");
        uint32_t tsch_start = msp430_elf_find_symbol(firmware_path, "tsch_is_started");
        if (tsch_coord && tsch_init && tsch_start) {
            uint8_t *mem = node->plat.msp.cpu.memory;
            uint32_t asn_addr = msp430_elf_find_symbol(firmware_path, "tsch_current_asn");
            uint32_t in_slot = msp430_elf_find_symbol(firmware_path, "tsch_in_slot_operation");
            uint32_t asn_lo = asn_addr ? (mem[asn_addr] | (mem[asn_addr+1]<<8) | (mem[asn_addr+2]<<16) | (mem[asn_addr+3]<<24)) : 0;
            uint32_t tsch_assoc = msp430_elf_find_symbol(firmware_path, "tsch_is_associated");
            uint32_t tsch_secured = msp430_elf_find_symbol(firmware_path, "tsch_is_pan_secured");
            uint32_t eb_period_addr = msp430_elf_find_symbol(firmware_path, "tsch_current_eb_period");
            uint32_t eb_period = eb_period_addr ? (mem[eb_period_addr] | (mem[eb_period_addr+1]<<8) |
                (mem[eb_period_addr+2]<<16) | (mem[eb_period_addr+3]<<24)) : 0;
            uint32_t leaf_only_addr = msp430_elf_find_symbol(firmware_path, "rpl_leaf_only");
            uint32_t used_addr = 0x2568;  /* curr_instance.used */
            uint32_t rank1 = 0x2572, rank2 = 0x25a6;
            uint32_t clock_count_addr = msp430_elf_find_symbol(firmware_path, "count");
            uint32_t clock_seconds_addr = msp430_elf_find_symbol(firmware_path, "seconds");
            uint32_t clock_count_val = clock_count_addr ?
                (mem[clock_count_addr] | (mem[clock_count_addr+1]<<8) |
                 (mem[clock_count_addr+2]<<16) | (mem[clock_count_addr+3]<<24)) : 0;
            uint32_t clock_seconds_val = clock_seconds_addr ?
                (mem[clock_seconds_addr] | (mem[clock_seconds_addr+1]<<8) |
                 (mem[clock_seconds_addr+2]<<16) | (mem[clock_seconds_addr+3]<<24)) : 0;
            printf("  Node %d TSCH: coord=%d init=%d started=%d assoc=%d secured=%d in_slot=%d asn=%u eb_period=%u "
                   "leaf_only=%d rpl_used=%d rank=%d/%d clock=%u/%us\n",
                node->id, mem[tsch_coord], mem[tsch_init], mem[tsch_start],
                tsch_assoc ? mem[tsch_assoc] : -1,
                tsch_secured ? mem[tsch_secured] : -1,
                in_slot ? mem[in_slot] : -1, asn_lo, eb_period,
                leaf_only_addr ? mem[leaf_only_addr] : -1,
                mem[used_addr],
                mem[rank1] | (mem[rank1+1]<<8),
                mem[rank2] | (mem[rank2+1]<<8),
                clock_count_val, clock_seconds_val);
        }
        break;
    }
    case SIM_MOTE_DIAG_CC2420_STATS: {
        cc2420_t *r = &node->plat.msp.cc2420;
        printf("  Node %d CC2420: state=%d on=%d spi=%d rx=%d/%d ack_rx=%d rej=%d ov=%d crc=%d/%d ack=%d "
               "incoming=%d replayed=%d dropped=%d "
               "strobes: rxon=%d txon=%d txoncca=%d rfoff=%d tx_cal=%d\n",
               node->id, r->state, r->on, r->stat_spi_count,
               r->stat_rx_started, r->stat_rx_completed, r->stat_rx_ack_completed,
               r->stat_rx_rejected, r->stat_rx_overflow,
               r->stat_crc_ok, r->stat_crc_fail, r->stat_auto_ack,
               r->stat_rx_buffered, r->stat_rx_replayed, r->stat_rx_dropped,
               r->stat_strobe_srxon, r->stat_strobe_stxon,
               r->stat_strobe_stxoncca, r->stat_strobe_srfoff,
               r->stat_tx_calibrate);
        break;
    }
    case SIM_MOTE_DIAG_NEIGHBOR_TABLE: {
        msp430_cpu_t *cpu = &node->plat.msp.cpu;
        /* Find _ds6_neighbors_mem and neighbor_addr_mem_memb_mem */
        uint32_t nbr_addr = msp430_elf_find_symbol(firmware_path,
            "neighbor_addr_mem_memb_mem");
        uint32_t nbr_used = msp430_elf_find_symbol(firmware_path,
            "neighbor_addr_mem_memb_used");
        if (nbr_addr && nbr_used && nbr_addr < cpu->max_mem) {
            /* neighbor_addr_mem_memb: 16 entries × 10 bytes (2-byte list ptr + 8-byte lladdr) */
            int num_entries = 16;
            int entry_size = 10;
            printf("  Node %d neighbor table (addr_mem at 0x%04x):\n", node->id, nbr_addr);
            for (int n = 0; n < num_entries; n++) {
                if (nbr_used + n < cpu->max_mem && cpu->memory[nbr_used + n]) {
                    uint8_t *ll = cpu->memory + nbr_addr + n * entry_size + 2;
                    printf("    [%d] lladdr=%02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x\n",
                           n, ll[0],ll[1],ll[2],ll[3],ll[4],ll[5],ll[6],ll[7]);
                }
            }
        }
        break;
    }
    case SIM_MOTE_DIAG_SR_TABLE: {
        if (node->id != 1) break;
        msp430_cpu_t *cpu = &node->plat.msp.cpu;
        uint32_t sr_mem = msp430_elf_find_symbol(firmware_path,
            "nodememb_memb_mem");
        uint32_t sr_used = msp430_elf_find_symbol(firmware_path,
            "nodememb_memb_used");
        if (sr_mem && sr_used && sr_mem < cpu->max_mem) {
            printf("  Node 1 SR table (nodememb at 0x%04x):\n", sr_mem);
            /* uip_sr_node_t: list ptr(2) + ipaddr suffix(2) + parent ptr(2) + ... = 18 bytes */
            for (int n = 0; n < 16; n++) {
                if (sr_used < cpu->max_mem && cpu->memory[sr_used + n]) {
                    uint8_t *entry = cpu->memory + sr_mem + n * 18;
                    /* Dump raw bytes to understand layout */
                    printf("    [%d] raw:", n);
                    for (int b = 0; b < 18; b++)
                        printf(" %02x", entry[b]);
                    printf("\n");
                }
            }
        }
        break;
    }
    default:
        break;
    }
}

/* ============================================================
 * Boot policy
 *
 * Every firmware patch below names the firmware symbol it depends on
 * (§9 Phase 4 stop condition).
 * ============================================================ */

int msp430_elf_mote_boot(mixed_node_t *node, int slot,
                         const char *firmware_path, int node_id,
                         const sim_mote_env_t *env) {
    int idx = slot;
    msp430_platform_t *plat = &node->plat.msp;

    /* Platform name comes from the board registry row (Phase 3). */
    const char *plat_name = node->board->name;
    const msp430_platform_config_t *pcfg = msp430_platform_find(plat_name);
    if (!pcfg) { fprintf(stderr, "Platform '%s' not found\n", plat_name); return -1; }

    msp430_platform_init(plat, pcfg);

    /* Disable JIT for multinode — the event-driven scheduler steps in
     * small increments (~1µs) where JIT overhead exceeds any benefit.
     * The interpreter also avoids the inblock-check performance cost. */
#ifdef HAVE_LIGHTNING
    if (plat->cpu.compiled_cache) {
        free(plat->cpu.compiled_cache);
        plat->cpu.compiled_cache = NULL;
    }
#endif

