nfi/cooja-ng/src/motes/msp430_elf_mote.c
    if (msp430_load_elf(&plat->cpu, firmware_path) != 0) {
        fprintf(stderr, "Cannot load firmware: %s\n", firmware_path);
        msp430_platform_destroy(plat);
        return -1;
    }

    /* Patch ds2411_init() to RET immediately */
    uint32_t ds2411_init_addr = msp430_elf_find_symbol(firmware_path, "ds2411_init");
    if (ds2411_init_addr != 0) {
        plat->cpu.memory[ds2411_init_addr]     = 0x30;
        plat->cpu.memory[ds2411_init_addr + 1] = 0x41;
        printf("  Patched ds2411_init at 0x%04x to RET\n", ds2411_init_addr);
    }

    /* Patch xmem_init() and node_id_z1_restore() to RET on MSP430X.
     * Without file-backed flash storage, xmem reads return garbage
     * and node_id_z1_restore sets node_id=0 + empty linkaddr, which
     * causes printf to output 70+ zero bytes overflowing the stack. */
    if (plat->cpu.config->is_msp430x) {
        const char *patch_fns[] = {"xmem_init", "node_id_z1_restore",
                                   NULL};
        for (int p = 0; patch_fns[p]; p++) {
            uint32_t addr = msp430_elf_find_symbol(firmware_path, patch_fns[p]);
            if (addr != 0) {
                plat->cpu.memory[addr]     = 0x10;  /* RETA */
                plat->cpu.memory[addr + 1] = 0x01;
                printf("  Patched %s at 0x%04x to RETA\n", patch_fns[p], addr);
            }
        }
    }

    msp430_platform_set_console(plat, env->uart_byte, node);
    /* Per-radio TX listener: CC2420 lives in slot 0. The chip stays
     * unaware of which slot it occupies; the harness encodes that in
     * the rf_listener_ctx_t it captures on the chip's side. */
    node->rf_ctx[0].node_idx  = idx;
    node->rf_ctx[0].radio_idx = 0;
    cc2420_set_rf_listener(&plat->cc2420, env->chip_tx_byte, &node->rf_ctx[0]);
    plat->cc2420.node_id = node_id;
    /* CC2420's FSCTRL writes push channel via the sim_host_t vtable
     * onto radio slot 0 for this node. Same adapter as the ARM path. */
    plat->host.radio_user_data  = node;
    plat->host.radio_set_channel = env->radio_set_channel;
    plat->host.radio_set_power   = env->radio_set_power;
    msp430_cpu_reset(&plat->cpu);

    /* Run past crt0 to main, then patch ds2411_id */
    uint32_t main_addr = msp430_elf_find_symbol(firmware_path, "main");
    if (main_addr != 0) {
        for (int s = 0; s < 200000; s++) {
            msp430_step(&plat->cpu, 1);
            if ((plat->cpu.reg[0] & 0xFFFF) == (main_addr & 0xFFFF))
                break;
        }
        printf("  Node %d [MSP430]: ran to main (0x%04x) in %lld cycles\n",
               node_id, main_addr, (long long)plat->cpu.cycles);
    } else {
        msp430_step(&plat->cpu, 50000);
    }

    /* Patch ds2411_id with unique address (Sky/classic MSP430).
     * Format: 00:12:74:id:00:id:id:id
     * Firmware does ds2411_id[2] &= 0xfe (0x74 is already even).
     * With IPv6: linkaddr = memcpy(ds2411_id, 8)
     * shortaddr = (linkaddr[0] << 8) | linkaddr[1] = 0x0012
     * IPv6 IID = 0212:74id:00id:idid → fd00::0212:74id:00id:idid
     * This matches Cooja's test CSC ping targets (e.g. fd00::0212:7404:0004:0404). */
    uint32_t ds2411_addr = msp430_elf_find_symbol(firmware_path, "ds2411_id");
    if (ds2411_addr != 0) {
        uint8_t *id = plat->cpu.memory + ds2411_addr;
        id[0] = 0x00; id[1] = 0x12; id[2] = 0x74;
        id[3] = (uint8_t)(node_id & 0xff);
        id[4] = (uint8_t)((node_id >> 8) & 0xff);
        id[5] = (uint8_t)(node_id & 0xff);
        id[6] = (uint8_t)(node_id & 0xff);
        id[7] = (uint8_t)(node_id & 0xff);
        printf("  Patched ds2411_id at 0x%04x for node %d: ", ds2411_addr, node_id);
        for (int i = 0; i < 8; i++) printf("%02x%s", id[i], i < 7 ? ":" : "\n");
    }

    /* Write infomem at 0x1980 — this is how Cooja's MspMoteID sets the
     * node ID and MAC address. The firmware reads infomem during init
     * to set node_id and linkaddr. Format: ABCD:0212:7400:0001:HI:LO */
    {
        uint32_t infomem_addr = 0x1980;
        if (infomem_addr + 10 <= plat->cpu.max_mem) {
            uint8_t *im = plat->cpu.memory + infomem_addr;
            im[0] = 0xAB; im[1] = 0xCD;  /* magic */
            im[2] = 0x02; im[3] = 0x12; im[4] = 0x74;
            im[5] = 0x00; im[6] = 0x00; im[7] = 0x01;
            im[8] = (uint8_t)((node_id >> 8) & 0xFF);
            im[9] = (uint8_t)(node_id & 0xFF);
            printf("  Patched infomem at 0x%04x for node %d: ", infomem_addr, node_id);
            for (int i = 0; i < 10; i++) printf("%02x%s", im[i], i < 9 ? ":" : "\n");
        }
    }

    /* Write node_id variable directly (like Cooja's MspMoteID.setMoteID).
     * The firmware uses node_id for RPL and application logic.
     * Must be written AFTER crt0 clears BSS but BEFORE platform_init. */
    {
        uint32_t nid = msp430_elf_find_symbol(firmware_path, "node_id");
        if (nid != 0 && nid + 2 <= plat->cpu.max_mem) {
            plat->cpu.memory[nid] = (uint8_t)(node_id & 0xFF);
            plat->cpu.memory[nid + 1] = (uint8_t)((node_id >> 8) & 0xFF);
            printf("  Patched node_id at 0x%04x = %d\n", nid, node_id);
        }
    }

    /* Patch linkaddr_node_addr and node_id for Z1/MSP430X.
     * Must happen AFTER crt0 clears BSS (run-to-main above) but
     * BEFORE platform_init reads them. */
    if (plat->cpu.config->is_msp430x) {
        const char *addr_syms[] = {"linkaddr_node_addr", "node_mac", "uip_lladdr", NULL};
        for (int a = 0; addr_syms[a]; a++) {
            uint32_t sym = msp430_elf_find_symbol(firmware_path, addr_syms[a]);
            if (sym != 0) {
                uint8_t *p = plat->cpu.memory + sym;
                /* Use same IEEE format as Cooja MspMote: c1:0c:00:00:00:00:00:id
                 * First byte must be non-zero or Z1 platform overwrites it */
                p[0] = 0xc1; p[1] = 0x0c;
                p[2] = 0x00; p[3] = 0x00;
                p[4] = 0x00; p[5] = 0x00;
                p[6] = 0x00; p[7] = (uint8_t)node_id;
            }
        }
        uint32_t nid_addr = msp430_elf_find_symbol(firmware_path, "node_id");
        if (nid_addr != 0) {
            plat->cpu.memory[nid_addr] = (uint8_t)node_id;
            plat->cpu.memory[nid_addr + 1] = 0;
        }
        printf("  Patched node_id=%d, linkaddr, node_mac for Z1\n", node_id);
    }


