nfi/cooja-ng/src/motes/msp430_elf_mote.c
    /* Run past main() entry through DCO calibration and platform init.
     * Must stop AFTER TimerA is running with events scheduled AND
     * CC2420 VREG enabled (if platform has CC2420). On Z1, clock_init
     * starts Timer A before cc2420_init enables VREG, so we need both
     * conditions. Use step batches of 10K for speed. */
    {
        int64_t limit = plat->cpu.cycles + 8000000;
        bool has_cc2420 = plat->config->cc2420.has_cc2420;
        while ((int64_t)plat->cpu.cycles < limit) {
            msp430_step_until(&plat->cpu, plat->cpu.cycles + 10000);
            bool timer_ok = plat->timer_a.mode != 0 && plat->cpu.event_queue != NULL;
            bool radio_ok = !has_cc2420 || plat->cc2420.state != CC2420_VREG_OFF;
            if (timer_ok && radio_ok) break;
        }
    }

    /* Note: no extended init needed for MSP430X. The event order fix
     * (events after instructions) and CCR0 reschedule fix allow the
     * clock ISR (CCR1) to fire normally during simulation, advancing
     * etimers and enabling process_run to execute. */

    printf("  Node %d [MSP430] initialized: PC=0x%04x SP=0x%04x cycles=%lld eq=%s next_ev=%lld\n",
           node_id, plat->cpu.reg[0], plat->cpu.reg[1],
           (long long)plat->cpu.cycles,
           plat->cpu.event_queue ? "yes" : "nil",
           (long long)plat->cpu.next_event_cycle);

    /* No firmware patches: Cooja MSPSim runs the firmware unmodified
     * and so should we. The firmware exports uip_ds6_addr_size and
     * uip_ds6_netif_addr_list_offset for tools (Cooja's IPAddress.java)
     * to observe — Cooja never WRITES the addr_list. The firmware does
     * its own IPv6 setup via uip_ds6_addr_add(). */

    return 0;
}

/* ============================================================
 * Radio endpoint ops + bus registration
 * ============================================================ */

static int msp_radio_rxfifo_available(void *m) {
    mixed_node_t *node = (mixed_node_t *)m;
    return 128 - node->plat.msp.cc2420.rx_fifo_len;
}
static void msp_radio_receive_byte(void *m, uint8_t byte, int8_t rssi) {
    mixed_node_t *node = (mixed_node_t *)m;
    node->plat.msp.cc2420.rx_rssi = rssi;
    cc2420_receive_byte(&node->plat.msp.cc2420, byte);
}
static bool msp_radio_rx_busy(void *m) {
    mixed_node_t *node = (mixed_node_t *)m;
    cc2420_radio_state_t s = node->plat.msp.cc2420.state;
    return s == CC2420_RX_FRAME || s == CC2420_RX_OVERFLOW;
}
static const mote_radio_ops_t msp_radio_ops = {
    msp_radio_receive_byte, msp_radio_rxfifo_available, msp_radio_rx_busy,
    NULL /* rx_stall */, NULL /* current_channel */, NULL /* mark_collisions */
};

void msp430_elf_mote_register_radio(mixed_node_t *node, int slot,
                                    sim_radio_bus_t *bus) {
    /* CC2420 has an rx_incoming buffer + state guard: one kernel
     * RX_BYTE event per on-air byte.  The three MSP430-only RF-delivery
     * quirks (in-line ticking step on synchronous RX, mini-step drain
     * when the RXFIFO is full, sender self-wake after a frame) are
     * declared as caps so the delivery code stays type-blind (M25). */
    sim_radio_bus_register(bus, slot, &msp_radio_ops, node,
                           SIM_RADIO_DELIVERY_PER_BYTE,
                           SIM_RADIO_CAP_RX_TICKING_STEP |
                           SIM_RADIO_CAP_DRAIN_MINI_STEP |
                           SIM_RADIO_CAP_WAKE_SENDER_POST_TX);
}

/* ============================================================
 * Cooja-style execute tick (ex runner tick_one_msp430)
 *
 * Exported — besides the runner's msp_mote_execute adapter, the
 * frame-delivery pre-sync path calls it for receivers that are not
 * the currently-ticking node (that path moves to the bus in Phase 5).
 * ============================================================ */

int64_t msp430_elf_mote_tick(mixed_node_t *node, int64_t sim_ns) {
    msp430_cpu_t *cpu = &node->plat.msp.cpu;
    int64_t t_us = sim_ns / 1000LL;
    int64_t jump_us = 0;

    if (cpu->last_execute_us >= 0) {
        jump_us = t_us - cpu->last_execute_us;
        if (jump_us < 0) jump_us = 0;
    }

    /* Apply clock deviation (Cooja MspClock drift simulation) */
    double deviation = node->clock_deviation;
    if (deviation != 1.0 && jump_us > 0) {
        double exact = (double)jump_us * deviation;
        jump_us = (int64_t)exact;
        /* Track sub-µs remainder (Cooja jumpError) */
        cpu->step_cycle_remainder += exact - (double)jump_us;
        if (cpu->step_cycle_remainder > 1.0) {
            jump_us++;
            cpu->step_cycle_remainder -= 1.0;
        }
    }

    /* Match Cooja's MspMote.execute(t, duration): peripheral events
     * raised during this execute slice should be scheduled relative to
     * the current scheduler time t, not a cycle-derived local time that
     * may have drifted. Pin sim_time_ns to sim_ns across the slice AND
     * re-anchor the cycle/ns conversion: the anchor expresses
     * "sim_time_ns at this cycle count" so subsequent execute_events
     * re-derives sim_time_ns from sim_ns + cycles-since-anchor at the
     * current freq, never lagging behind the scheduler. */
    cpu->sim_time_ns = sim_ns;
    cpu->anchor_sim_time_ns = sim_ns;
    cpu->anchor_cycles = cpu->cycles;
    int64_t returned_us = msp430_step_micros(cpu, jump_us, 1);
    cpu->sim_time_ns = sim_ns;
    cpu->anchor_sim_time_ns = sim_ns;
    cpu->anchor_cycles = cpu->cycles;

    if (deviation != 1.0 && returned_us > 0)
        returned_us = (int64_t)((double)returned_us / deviation);

    cpu->last_execute_us = t_us;
    return returned_us;
}

/* ============================================================
 * Mote vtable adapters (M38 — moved from the runner; §3.19).
 *
 * Character-identical to the runner's msp_mote_* functions, with the
 * runner-global seams rewired through the mote: nodes[idx] → MOTE_IMPL(m),
 * &radio_bus → node->env->radio_bus, &sim_rt → node->env->sim,
 * emu_rx_queue_drain(idx) → sim_radio_bus_drain_rx(),
 * schedule_emulated_wakeup() → sim_radio_bus_wake_mote(),
 * step_node_until() → m->ops->step_until(), node_freq/cycles → cpu fields.
 * ============================================================ */

