nfi/cooja-ng/src/motes/msp430_elf_mote.c
/* GPIO input from outside: ports P1..P10, 1-based as in the datasheet;
 * msp430_gpio_set_input_pin raises the pin interrupt the firmware enabled. */
static int msp_mote_set_input_pin(sim_mote_t *m, int port, int pin, int level) {
    msp430_gpio_t *gpio = &MOTE_IMPL(m)->plat.msp.gpio;
    if (port < 1 || port > gpio->num_ports || pin < 0 || pin > 7) return -1;
    msp430_gpio_set_input_pin(gpio, port, pin, level != 0);
    return 0;
}

/* User buttons of the MSP430 boards Contiki-NG drives with a button sensor:
 * Tmote Sky P2.7 and Zolertia Z1 P2.5, both active-low with a pull-up. */
static int msp_mote_button_pin(const sim_mote_t *m, int *port, int *pin, bool *active_low) {
    const char *name = MOTE_IMPL(m)->board ? MOTE_IMPL(m)->board->name : NULL;
    if (!name) return -1;
    if (!strcmp(name, "sky")) { *port = 2; *pin = 7; *active_low = true; return 0; }
    if (!strcmp(name, "z1"))  { *port = 2; *pin = 5; *active_low = true; return 0; }
    return -1;
}

static void msp_mote_ui_leds(const sim_mote_t *m, uint8_t leds[3]) {
    uint8_t p5out = MOTE_IMPL(m)->plat.msp.gpio.ports[4].out;
    leds[0] = (p5out >> 4) & 1;  /* green  = P5.4 */
    leds[1] = (p5out >> 5) & 1;  /* yellow = P5.5 */
    leds[2] = (p5out >> 6) & 1;  /* red    = P5.6 */
}

static void *msp_mote_get_interface(sim_mote_t *m, int iface) {
    if (iface == SIM_MOTE_IFACE_CC2420)
        return &MOTE_IMPL(m)->plat.msp.cc2420;
    return NULL;
}

const sim_mote_ops_t msp430_elf_mote_ops = {
    .kind            = "MSP430",
    .sim_time_ns     = msp_mote_sim_time_ns,
    .cycles          = msp_mote_cycles,
    .freq_hz         = msp_mote_freq_hz,
    .instructions    = msp_mote_instructions,
    .execute         = msp_mote_execute,
    .step_until      = msp_mote_step_until,
    .sched_hint_ns   = msp_mote_sched_hint_ns,
    .sync_to_time    = msp_mote_sync_to_time,
    .serial_input    = msp_mote_serial_input,
    .destroy         = msp_mote_destroy,
    .reset_time      = msp_mote_reset_time,
    .ui_radio_state  = msp_mote_ui_radio_state,
    .ui_leds         = msp_mote_ui_leds,
    .set_input_pin   = msp_mote_set_input_pin,
    .button_pin      = msp_mote_button_pin,
    .get_interface   = msp_mote_get_interface,
    .receive_frame   = NULL, /* per-byte / staged delivery */
    .rx_byte_sync    = msp_mote_rx_byte_sync,
    .rx_pre_sync     = msp_mote_rx_pre_sync,
    .dump_diagnostics = msp430_elf_mote_dump_diagnostics,
    .program_counter = msp_mote_program_counter,
    .cpu_power_ns = msp_mote_cpu_power_ns,
};
